lucasmoraeseng/STM3205P/3.Firmware/STM3205P/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
// ADC 1   -> Output Voltage Measure
// ADC 2   -> Output Current Measure
// TIM 1   -> PWM to fan control
// TIM 2   -> Periodic interrupt for display update 1ms
// TIM 3   -> Periodic interrupt for ADC Measure
// USART 1 -> Serial communication
// SPI 1   -> Communication with DAC8830

/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "DAC8830.h"
#include "RingBuffer.h"
#include "button.h"
#include "display.h"
#include "flash.h"
#include "keyboard.h"
#include "led_indicator.h"
#include "stm32f1xx_hal.h"
#include "stm32f1xx_hal_adc.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
ADC_HandleTypeDef hadc2;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;

UART_HandleTypeDef huart1;

/* USER CODE BEGIN PV */
ADC_ChannelConfTypeDef cfgVoltageADC;
ADC_ChannelConfTypeDef cfgCurrentADC;
ADC_ChannelConfTypeDef cfgTemperatureADC;

uint8_t enChangeValue = 0;
uint8_t digitToChange = 0;
uint32_t startBlink = 0;

uint8_t outputState = 0;

RingBuffer_t RBVoltage;
RingBuffer_t RBCurrent;

ADC1_ChannelMode adc1_channel_mode = ADC1_CHANNEL_VOLTAGE;
uint32_t ADC_SampleCounter = 0;
uint32_t lastADCSample = 0;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_ADC1_Init(void);
static void MX_ADC2_Init(void);
static void MX_TIM1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_TIM2_Init(void);
static void MX_SPI1_Init(void);
static void MX_TIM3_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
    if(htim->Instance == TIM1)
    {
    }
    else if(htim->Instance == TIM2)
    {
        display.frame_cnt++;
        if(display.frame_cnt % 512 == 0)
        {
            display.blink_state = !display.blink_state;
        }

        if(display.frame_cnt % 10 == 0)
        {
            HAL_ADC_Start_IT(&hadc1); // Start ADC1 with interruption
            HAL_ADC_Start_IT(&hadc2); // Start ADC2 with interruption
        }

        if((display.frame_cnt + 5) % 100 == 0)
        {
            HAL_ADC_ConfigChannel(&hadc1, &cfgTemperatureADC);
            adc1_channel_mode = ADC1_CHANNEL_TEMPERATURE;
        }

        if((display.frame_cnt + 6) % 100 == 0)
        {
            HAL_ADC_ConfigChannel(&hadc1, &cfgVoltageADC);
            adc1_channel_mode = ADC1_CHANNEL_VOLTAGE;
        }

        if(display.beep)
        {
            display.beep_cnt++;
        }

        if(display.beep_cnt > display.beep_duration)
        {
            display.beep_cnt = 0;
            display.beep = 0;
            HAL_GPIO_WritePin(BY_GPIO_Port, BY_Pin, GPIO_PIN_RESET);
        }

        Display_Update(&display);
    }
    else if(htim->Instance == TIM3)
    {
        if(display.beep)
        {
            display.beep_phase += display.beep_increment;

            if(display.beep_phase & 0x8000)
            {
                HAL_GPIO_WritePin(
                    BY_GPIO_Port,
                    BY_Pin,
                    GPIO_PIN_SET);
            }
            else
            {
                HAL_GPIO_WritePin(
                    BY_GPIO_Port,
                    BY_Pin,
                    GPIO_PIN_RESET);
            }
        }
    }
}

void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc)
{
    if(hadc->Instance == ADC1)
    {
        uint16_t value1 = HAL_ADC_GetValue(&hadc1);
        if(adc1_channel_mode == ADC1_CHANNEL_VOLTAGE)
        {
            // RingBuffer_Put(&RBVoltage, (RBDataType)value1);
            measuredData.Voltage = value1;
        }
        else if(adc1_channel_mode == ADC1_CHANNEL_TEMPERATURE)
        {
            // RingBuffer_Put(&RBTemperature, (RBDataType)value1);
        }
        ADC_SampleCounter++;
    }
    else if(hadc->Instance == ADC2)
    {
        uint16_t value2 = HAL_ADC_GetValue(&hadc2);
        // RingBuffer_Put(&RBCurrent, (RBDataType)value2);
        measuredData.Current = value2;
    }
}

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void)
{

    /* USER CODE BEGIN 1 */

    Flash_ReadSettings(&flashData);

    cfgVoltageADC.Channel = ADC_CHANNEL_1;
    cfgVoltageADC.Rank = ADC_REGULAR_RANK_1;
    cfgVoltageADC.SamplingTime = ADC_SAMPLETIME_1CYCLE_5;

    cfgCurrentADC.Channel = ADC_CHANNEL_2;
    cfgCurrentADC.Rank = ADC_REGULAR_RANK_1;
    cfgCurrentADC.SamplingTime = ADC_SAMPLETIME_1CYCLE_5;

    cfgTemperatureADC.Channel = ADC_CHANNEL_3;
    cfgTemperatureADC.Rank = ADC_REGULAR_RANK_1;
    cfgTemperatureADC.SamplingTime = ADC_SAMPLETIME_1CYCLE_5;

    /* USER CODE END 1 */

    /* MCU Configuration--------------------------------------------------------*/

    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

