lucasmoraeseng/STM3205P/3.Firmware/STM3205P/Core/Src/main.c
    /* USER CODE BEGIN Init */
    Display_Init(&display);

    LedIndicator_Set(&display.ledM1);

    actualData.Voltage = flashData.memory1.Voltage;
    actualData.Current = flashData.memory1.Current;
    actualData.OCP = flashData.memory1.OCP;
    actualData.OVP = flashData.memory1.OVP;

    Display_PrepareDataACCX3(&display, actualData);

    // display.blink_display = 2;
    // display.blink_index = 1;

    Keyboard_Init(&Keyboard);

    /* USER CODE END Init */

    /* Configure the system clock */
    SystemClock_Config();

    /* USER CODE BEGIN SysInit */

    /* USER CODE END SysInit */

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_ADC1_Init();
    MX_ADC2_Init();
    MX_TIM1_Init();
    MX_USART1_UART_Init();
    MX_TIM2_Init();
    MX_SPI1_Init();
    MX_TIM3_Init();
    /* USER CODE BEGIN 2 */

    HAL_ADC_ConfigChannel(&hadc1, &cfgVoltageADC);
    HAL_ADC_ConfigChannel(&hadc2, &cfgCurrentADC);
    // HAL_ADC_Start_DMA(&hadc1, (uint32_t *)ADC1_Buffer, 2);
    // HAL_ADC_Start_DMA(&hadc2, (uint32_t *)ADC2_Buffer, 1);

    HAL_TIM_OC_Start(&htim2, TIM_CHANNEL_2);
    HAL_TIM_Base_Start_IT(&htim2); // Timer with interruption
    HAL_TIM_Base_Start_IT(&htim3); // Timer with interruption

    /* USER CODE END 2 */

    /* Infinite loop */
    /* USER CODE BEGIN WHILE */
    while(1)
    {
        Keyboard_Read(&Keyboard, display.frame_cnt);

        if(outputState)
        {
            if(lastADCSample != ADC_SampleCounter)
            {
                lastADCSample = ADC_SampleCounter;
                Display_PrepareDataACCX3(&display, measuredData);
            }

            if(Button_KeyUpEvent(&Keyboard.OCP))
            {
                measuredData.OCP = !measuredData.OCP;
                LedIndicator_WriteValue(&display.ledOCP, measuredData.OCP);
                if(flashData.beep)
                {
                    Buzzer_Play(&display, BUZZER_TONE_A4, 100);
                }
            }

            if(Button_KeyUpEvent(&Keyboard.OVP))
            {
                measuredData.OVP = !measuredData.OVP;
                LedIndicator_WriteValue(&display.ledOVP, measuredData.OVP);
                if(flashData.beep)
                {
                    Buzzer_Play(&display, BUZZER_TONE_A4, 100);
                }
            }
        }
        else
        {
            if(Button_KeyUpEvent(&Keyboard.M1))
            {
                enChangeValue = false;
                display.blink_display = 0;
                Display_ClearMemoryLeds(&display);
                LedIndicator_Set(&display.ledM1);
                // LedIndicator_Blink(&display.ledM1, display.frame_cnt);
                actualData = flashData.memory1;
                Display_PrepareDataACCX3(&display, actualData);
                if(flashData.beep)
                {
                    Buzzer_Play(&display, BUZZER_TONE_B4, 100);
                }
            }

            if(Button_KeyPressedTimeEvent(&Keyboard.M1, display.frame_cnt, 5000))
            {
                enChangeValue = false;
                display.blink_display = 0;
                flashData.memory1 = actualData;
                Flash_WriteSettings(&flashData);
                LedIndicator_Blink(&display.ledM1, display.frame_cnt);

                if(flashData.beep)
                {
                    Buzzer_Play(&display, BUZZER_TONE_B4, 500);
                }
            }

            if(Button_KeyUpEvent(&Keyboard.M2))
            {
                enChangeValue = false;
                display.blink_display = 0;
                Display_ClearMemoryLeds(&display);
                LedIndicator_Set(&display.ledM2);
                actualData = flashData.memory2;
                Display_PrepareDataACCX3(&display, actualData);
                if(flashData.beep)
                {
                    Buzzer_Play(&display, BUZZER_TONE_C4, 100);
                }
            }

            if(Button_KeyPressedTimeEvent(&Keyboard.M2, display.frame_cnt, 5000))
            {
                enChangeValue = false;
                display.blink_display = 0;
                flashData.memory2 = actualData;
                Flash_WriteSettings(&flashData);
                LedIndicator_Blink(&display.ledM2, display.frame_cnt);

                if(flashData.beep)
                {
                    Buzzer_Play(&display, BUZZER_TONE_C4, 500);
                }
            }

            if(Button_KeyUpEvent(&Keyboard.M3))
            {
                enChangeValue = false;
                display.blink_display = 0;
                Display_ClearMemoryLeds(&display);
                LedIndicator_Set(&display.ledM3);
                actualData = flashData.memory3;
                Display_PrepareDataACCX3(&display, actualData);
                if(flashData.beep)
                {
                    Buzzer_Play(&display, BUZZER_TONE_D4, 100);
                }
            }

            if(Button_KeyPressedTimeEvent(&Keyboard.M3, display.frame_cnt, 5000))
            {
                enChangeValue = false;
                display.blink_display = 0;
                flashData.memory3 = actualData;
                Flash_WriteSettings(&flashData);
                LedIndicator_Blink(&display.ledM3, display.frame_cnt);

                if(flashData.beep)
                {
                    Buzzer_Play(&display, BUZZER_TONE_D4, 500);
                }
            }

            if(Button_KeyUpEvent(&Keyboard.M4))
            {
                enChangeValue = false;
                display.blink_display = 0;
                Display_ClearMemoryLeds(&display);
                LedIndicator_Set(&display.ledM4);
                actualData = flashData.memory4;
                Display_PrepareDataACCX3(&display, actualData);
                if(flashData.beep)
                {
                    Buzzer_Play(&display, BUZZER_TONE_E4, 100);
                }
            }

            if(Button_KeyPressedTimeEvent(&Keyboard.M4, display.frame_cnt, 5000))
            {
                enChangeValue = false;
                display.blink_display = 0;
                flashData.memory4 = actualData;
                Flash_WriteSettings(&flashData);
                LedIndicator_Blink(&display.ledM4, display.frame_cnt);

                if(flashData.beep)
                {
                    Buzzer_Play(&display, BUZZER_TONE_E4, 500);
                }
            }

