lucasmoraeseng/STM3205P/3.Firmware/STM3205P/Core/Src/main.c
            if(Button_KeyUpEvent(&Keyboard.OCP))
            {
                actualData.OCP = !actualData.OCP;
                LedIndicator_WriteValue(&display.ledOCP, actualData.OCP);
                if(flashData.beep)
                {
                    Buzzer_Play(&display, BUZZER_TONE_A4, 100);
                }
            }

            if(Button_KeyUpEvent(&Keyboard.OVP))
            {
                actualData.OVP = !actualData.OVP;
                LedIndicator_WriteValue(&display.ledOVP, actualData.OVP);
                if(flashData.beep)
                {
                    Buzzer_Play(&display, BUZZER_TONE_A4, 100);
                }
            }

            if(Button_KeyUpEvent(&Keyboard.VoltageCurrent))
            {
                if(enChangeValue)
                {
                    if(display.blink_display == 1)
                    {
                        display.blink_display = 2;
                    }
                    else
                    {
                        display.blink_display = 1;
                    }
                }
                else
                {
                    enChangeValue = true;
                    display.blink_display = 1;
                    display.blink_index = 1;
                }

                startBlink = display.frame_cnt;
                if(flashData.beep)
                {
                    Buzzer_Play(&display, BUZZER_TONE_A4, 100);
                }
            }

            if(Button_KeyUpEvent(&Keyboard.LeftArrow))
            {
                if(enChangeValue)
                {
                    if(display.blink_index > 1)
                    {
                        display.blink_index--;
                    }
                }
                startBlink = display.frame_cnt;
                if(flashData.beep)
                {
                    Buzzer_Play(&display, BUZZER_TONE_A4, 100);
                }
            }

            if(Button_KeyUpEvent(&Keyboard.RightArrow))
            {
                if(enChangeValue)
                {
                    if(display.blink_index < 4)
                    {
                        display.blink_index++;
                    }
                }
                startBlink = display.frame_cnt;
                if(flashData.beep)
                {
                    Buzzer_Play(&display, BUZZER_TONE_A4, 100);
                }
            }

            if(enChangeValue)
            {
                if(display.frame_cnt - startBlink > 10000)
                {
                    enChangeValue = false;
                    display.blink_display = 0;
                }

                if(Keyboard.DialValue != 0)
                {
                    startBlink = display.frame_cnt;
                    if(display.blink_display == 2)
                    {
                        Keyboard_ValueAdjust(&Keyboard,
                                             display.blink_index,
                                             &actualData.Voltage,
                                             VOLTAGE_LIMIT_SUPERIOR,
                                             VOLTAGE_LIMIT_INFERIOR);
                    }
                    else if(display.blink_display == 1)
                    {
                        Keyboard_ValueAdjust(&Keyboard,
                                             display.blink_index,
                                             &actualData.Current,
                                             CURRENT_LIMIT_SUPERIOR,
                                             CURRENT_LIMIT_INFERIOR);
                    }

                    Display_PrepareDataACCX3(&display, actualData);
                }
            }
        }

        if(Button_KeyPressedTimeEvent(&Keyboard.Lock, display.frame_cnt, 5000))
        {
            flashData.beep = !flashData.beep;
            Buzzer_Play(&display, BUZZER_TONE_C5, 500);
            Flash_WriteSettings(&flashData);
        }

        if(Button_KeyUpEvent(&Keyboard.OnOff))
        {
            enChangeValue = false;
            display.blink_display = 0;
            outputState = !outputState;
            LedIndicator_WriteValue(&display.ledOUT, outputState);
            measuredData.OCP = actualData.OCP;
            measuredData.OVP = actualData.OVP;

            if(outputState)
            {
                Display_PrepareDataACCX3(&display, measuredData);
            }
            else
            {
                Display_PrepareDataACCX3(&display, actualData);
            }

            if(flashData.beep)
            {
                Buzzer_Play(&display, BUZZER_TONE_B3, 100);
            }
        }

        /* USER CODE END WHILE */

        /* USER CODE BEGIN 3 */
    }
    /* USER CODE END 3 */
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
    RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};

    /** Initializes the RCC Oscillators according to the specified parameters
     * in the RCC_OscInitTypeDef structure.
     */
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV2;
    RCC_OscInitStruct.HSIState = RCC_HSI_ON;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
    if(HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
    {
        Error_Handler();
    }

    /** Initializes the CPU, AHB and APB buses clocks
     */
    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

    if(HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
    {
        Error_Handler();
    }
    PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_ADC;
    PeriphClkInit.AdcClockSelection = RCC_ADCPCLK2_DIV6;
    if(HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
    {
        Error_Handler();
    }
}

/**
 * @brief ADC1 Initialization Function
 * @param None
 * @retval None
 */
static void MX_ADC1_Init(void)
{

    /* USER CODE BEGIN ADC1_Init 0 */

